; ModuleID = 'io'
source_filename = "io.rcp"
target datalayout = "e-m:w-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-windows-msvc"

%slice.6 = type { i64, ptr }
%string = type { ptr, i64 }
%init.TypeInfo = type { i64, %init.TypeUnion }
%init.TypeUnion = type { %init.StructType }
%init.StructType = type { %slice, %string, i32 }
%slice = type { i64, ptr }
%slice.1 = type { i64, ptr }
%init.BasicType = type { i64, i32, i32, %string }
%init.FunctionType = type { %slice.1, %slice.1 }
%init.PointerType = type { i64, i1 }
%init.ArrayType = type { i64, i32 }
%init.SliceType = type { i64 }
%init.EnumType = type { %string, %slice.2, i64 }
%slice.2 = type { i64, ptr }
%init.GenericType = type { %string }
%init.Arg = type { i64, ptr }
%init.StructMember = type { %string, i64 }
%slice.8 = type { i64, ptr }
%mem.Allocator = type { ptr, ptr, ptr }
%slice.7 = type { i64, ptr }
%slice.3 = type { i64, ptr }

@main.input = external global ptr
@init.INVALID_TYPE = external global i64
@init.type_table = external global %slice.6
@os.STD_INPUT_HANDLE = external global i32
@os.STD_OUTPUT_HANDLE = external global i32
@os.STD_ERROR_HANDLE = external global i32
@os.INVALID_HANDLE_VALUE = external global ptr
@os.CP_UTF7 = external global i32
@os.CP_UTF8 = external global i32
@os.MEM_COMMIT = external global i32
@os.MEM_RESERVE = external global i32
@os.MEM_RELEASE = external global i32
@os.PAGE_NOACCESS = external global i32

!1 = !DIFile(filename: "io.rcp", directory: "E:\\C_Projects\\ReComp\\std")
!2 = !{!3, !15, !36, !45, !50, !54, !65, !71}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "init.TypeKind", scope: !1, file: !1, size: 64, align: 64, elements: !4)
!4 = !{!5, !6, !7, !8, !9, !10, !11, !12, !13, !14}
!5 = !DIEnumerator(name: "Invalid", value: 0, isUnsigned: true)
!6 = !DIEnumerator(name: "Basic", value: 1, isUnsigned: true)
!7 = !DIEnumerator(name: "Function", value: 2, isUnsigned: true)
!8 = !DIEnumerator(name: "Struct", value: 3, isUnsigned: true)
!9 = !DIEnumerator(name: "Pointer", value: 4, isUnsigned: true)
!10 = !DIEnumerator(name: "Array", value: 5, isUnsigned: true)
!11 = !DIEnumerator(name: "Slice", value: 6, isUnsigned: true)
!12 = !DIEnumerator(name: "Vector", value: 7, isUnsigned: true)
!13 = !DIEnumerator(name: "Enum", value: 8, isUnsigned: true)
!14 = !DIEnumerator(name: "Generic", value: 9, isUnsigned: true)
!15 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "init.BasicKind", scope: !1, file: !1, size: 64, align: 64, elements: !16)
!16 = !{!17, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34, !35}
!17 = !DIEnumerator(name: "Bool", value: 0, isUnsigned: true)
!18 = !DIEnumerator(name: "String", value: 1, isUnsigned: true)
!19 = !DIEnumerator(name: "U8", value: 2, isUnsigned: true)
!20 = !DIEnumerator(name: "U16", value: 3, isUnsigned: true)
!21 = !DIEnumerator(name: "U32", value: 4, isUnsigned: true)
!22 = !DIEnumerator(name: "U64", value: 5, isUnsigned: true)
!23 = !DIEnumerator(name: "I8", value: 6, isUnsigned: true)
!24 = !DIEnumerator(name: "I16", value: 7, isUnsigned: true)
!25 = !DIEnumerator(name: "I32", value: 8, isUnsigned: true)
!26 = !DIEnumerator(name: "I64", value: 9, isUnsigned: true)
!27 = !DIEnumerator(name: "F32", value: 10, isUnsigned: true)
!28 = !DIEnumerator(name: "F64", value: 11, isUnsigned: true)
!29 = !DIEnumerator(name: "untypedInteger", value: 12, isUnsigned: true)
!30 = !DIEnumerator(name: "untypedFloat", value: 13, isUnsigned: true)
!31 = !DIEnumerator(name: "Int", value: 14, isUnsigned: true)
!32 = !DIEnumerator(name: "Uint", value: 15, isUnsigned: true)
!33 = !DIEnumerator(name: "Type", value: 16, isUnsigned: true)
!34 = !DIEnumerator(name: "Auto", value: 17, isUnsigned: true)
!35 = !DIEnumerator(name: "Module", value: 18, isUnsigned: true)
!36 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "init.BasicFlag", scope: !1, file: !1, size: 32, align: 32, elements: !37)
!37 = !{!38, !39, !40, !41, !42, !43, !44}
!38 = !DIEnumerator(name: "Boolean", value: 1, isUnsigned: true)
!39 = !DIEnumerator(name: "Integer", value: 2, isUnsigned: true)
!40 = !DIEnumerator(name: "Float", value: 4, isUnsigned: true)
!41 = !DIEnumerator(name: "String", value: 8, isUnsigned: true)
!42 = !DIEnumerator(name: "Untyped", value: 32, isUnsigned: true)
!43 = !DIEnumerator(name: "Unsigned", value: 64, isUnsigned: true)
!44 = !DIEnumerator(name: "TypeID", value: 128, isUnsigned: true)
!45 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "init.StructFlag", scope: !1, file: !1, size: 32, align: 32, elements: !46)
!46 = !{!47, !48, !49}
!47 = !DIEnumerator(name: "Packed", value: 1, isUnsigned: true)
!48 = !DIEnumerator(name: "Generic", value: 2, isUnsigned: true)
!49 = !DIEnumerator(name: "Union", value: 4, isUnsigned: true)
!50 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "init.VectorKind", scope: !1, file: !1, size: 64, align: 64, elements: !51)
!51 = !{!52, !53}
!52 = !DIEnumerator(name: "Float", value: 0, isUnsigned: true)
!53 = !DIEnumerator(name: "Int", value: 1, isUnsigned: true)
!54 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "compile.CompileFlag", scope: !1, file: !1, size: 32, align: 32, elements: !55)
!55 = !{!56, !57, !58, !59, !60, !61, !62, !63, !64}
!56 = !DIEnumerator(name: "Debug", value: 1, isUnsigned: true)
!57 = !DIEnumerator(name: "SanAddress", value: 2, isUnsigned: true)
!58 = !DIEnumerator(name: "SanMemory", value: 4, isUnsigned: true)
!59 = !DIEnumerator(name: "SanThread", value: 8, isUnsigned: true)
!60 = !DIEnumerator(name: "SanUndefined", value: 16, isUnsigned: true)
!61 = !DIEnumerator(name: "NoStdLib", value: 32, isUnsigned: true)
!62 = !DIEnumerator(name: "SharedLib", value: 64, isUnsigned: true)
!63 = !DIEnumerator(name: "CrossAndroid", value: 128, isUnsigned: true)
!64 = !DIEnumerator(name: "NoLink", value: 256, isUnsigned: true)
!65 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "compile.Arch", scope: !1, file: !1, size: 32, align: 32, elements: !66)
!66 = !{!67, !68, !69, !70}
!67 = !DIEnumerator(name: "x86_64", value: 0, isUnsigned: true)
!68 = !DIEnumerator(name: "x86", value: 1, isUnsigned: true)
!69 = !DIEnumerator(name: "Arm32", value: 2, isUnsigned: true)
!70 = !DIEnumerator(name: "Arm64", value: 4, isUnsigned: true)
!71 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "main.Tile", scope: !1, file: !1, size: 64, align: 64, elements: !72)
!72 = !{!73, !74, !75, !76}
!73 = !DIEnumerator(name: "Wall", value: 0, isUnsigned: true)
!74 = !DIEnumerator(name: "Empty", value: 1, isUnsigned: true)
!75 = !DIEnumerator(name: "Start", value: 2, isUnsigned: true)
!76 = !DIEnumerator(name: "End", value: 3, isUnsigned: true)
!77 = !{i32 2, !"CodeView", i32 1}
!78 = !{i32 2, !"Debug Info Version", i32 3}
!79 = distinct !DISubprogram(name: "push_string", linkageName: "io.push_string", scope: !1, file: !1, line: 9, type: !80, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !96)
!80 = !DISubroutineType(types: !81)
!81 = !{null, !82, !90}
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*[]u32", baseType: !83, size: 64, align: 64, dwarfAddressSpace: 0)
!83 = !DICompositeType(tag: DW_TAG_structure_type, scope: !1, file: !1, size: 128, align: 64, elements: !84)
!84 = !{!85, !87}
!85 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1, file: !1, baseType: !86, size: 64, align: 64)
!86 = !DIBasicType(name: "int", size: 64, encoding: DW_ATE_signed)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1, file: !1, baseType: !88, size: 64, align: 64, offset: 64)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*u32", baseType: !89, size: 64, align: 64, dwarfAddressSpace: 0)
!89 = !DIBasicType(name: "u32", size: 32, encoding: DW_ATE_unsigned)
!90 = !DICompositeType(tag: DW_TAG_structure_type, name: "string", scope: !1, file: !1, size: 128, elements: !91)
!91 = !{!92, !95}
!92 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1, file: !1, baseType: !93, size: 64, align: 64)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*u8", baseType: !94, size: 64, align: 64, dwarfAddressSpace: 0)
!94 = !DIBasicType(name: "u8", size: 8, encoding: DW_ATE_unsigned)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1, file: !1, baseType: !86, size: 64, align: 64, offset: 64)
!96 = !{}
!97 = !DILocation(line: 9, scope: !79)
!98 = !DILocalVariable(name: "b", scope: !79, file: !1, line: 9, type: !82)
!99 = !DILocalVariable(name: "to_push", arg: 1, scope: !79, file: !1, line: 9, type: !90)
!100 = !DILocation(line: 10, scope: !79)
!101 = !DILocalVariable(name: "c", scope: !79, file: !1, line: 10, type: !89)
!102 = !DILocalVariable(name: "i", scope: !79, file: !1, line: 10, type: !86)
!103 = !DILocation(line: 11, scope: !79)
!104 = !DILocation(line: 13, scope: !79)
!105 = distinct !DISubprogram(name: "format_uint", linkageName: "io.format_uint", scope: !1, file: !1, line: 15, type: !106, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !96)
!106 = !DISubroutineType(types: !107)
!107 = !{null, !82, !108}
!108 = !DIBasicType(name: "uint", size: 64, encoding: DW_ATE_unsigned)
!109 = !DILocation(line: 15, scope: !105)
!110 = !DILocalVariable(name: "b", scope: !105, file: !1, line: 15, type: !82)
!111 = !DILocalVariable(name: "num_in", arg: 1, scope: !105, file: !1, line: 15, type: !108)
!112 = !DILocation(line: 16, scope: !105)
!113 = !DILocalVariable(name: "temp", scope: !105, file: !1, line: 16, type: !114)
!114 = !DICompositeType(tag: DW_TAG_array_type, baseType: !89, size: 8192, align: 32, elements: !115)
!115 = !{!116}
!116 = !DISubrange(count: 256, lowerBound: 0)
!117 = !DILocation(line: 17, scope: !105)
!118 = !DILocalVariable(name: "num", scope: !105, file: !1, line: 17, type: !108)
!119 = !DILocation(line: 18, scope: !105)
!120 = !DILocation(line: 19, scope: !105)
!121 = !DILocation(line: 20, scope: !105)
!122 = !DILocation(line: 23, scope: !105)
!123 = !DILocalVariable(name: "count", scope: !105, file: !1, line: 23, type: !86)
!124 = !DILocation(line: 24, scope: !105)
!125 = !DILocation(line: 25, scope: !105)
!126 = !DILocalVariable(name: "digit", scope: !105, file: !1, line: 25, type: !108)
!127 = !DILocation(line: 26, scope: !105)
!128 = !DILocation(line: 27, scope: !105)
!129 = !DILocalVariable(name: "c", scope: !105, file: !1, line: 27, type: !108)
!130 = !DILocation(line: 28, scope: !105)
!131 = !DILocation(line: 29, scope: !105)
!132 = !DILocation(line: 32, scope: !105)
!133 = !DILocalVariable(name: "i", scope: !105, file: !1, line: 32, type: !86)
!134 = !DILocation(line: 33, scope: !105)
!135 = !DILocation(line: 35, scope: !105)
!136 = distinct !DISubprogram(name: "format_int", linkageName: "io.format_int", scope: !1, file: !1, line: 37, type: !137, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !96)
!137 = !DISubroutineType(types: !138)
!138 = !{null, !82, !86}
!139 = !DILocation(line: 37, scope: !136)
!140 = !DILocalVariable(name: "b", scope: !136, file: !1, line: 37, type: !82)
!141 = !DILocalVariable(name: "num_in", arg: 1, scope: !136, file: !1, line: 37, type: !86)
!142 = !DILocation(line: 38, scope: !136)
!143 = !DILocalVariable(name: "temp", scope: !136, file: !1, line: 38, type: !114)
!144 = !DILocation(line: 39, scope: !136)
!145 = !DILocalVariable(name: "num", scope: !136, file: !1, line: 39, type: !86)
!146 = !DILocation(line: 40, scope: !136)
!147 = !DILocation(line: 41, scope: !136)
!148 = !DILocation(line: 42, scope: !136)
!149 = !DILocation(line: 45, scope: !136)
!150 = !DILocalVariable(name: "is_neg", scope: !136, file: !1, line: 45, type: !151)
!151 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!152 = !DILocation(line: 46, scope: !136)
!153 = !DILocation(line: 47, scope: !136)
!154 = !DILocation(line: 48, scope: !136)
!155 = !DILocation(line: 51, scope: !136)
!156 = !DILocalVariable(name: "count", scope: !136, file: !1, line: 51, type: !86)
!157 = !DILocation(line: 52, scope: !136)
!158 = !DILocation(line: 53, scope: !136)
!159 = !DILocalVariable(name: "digit", scope: !136, file: !1, line: 53, type: !86)
!160 = !DILocation(line: 54, scope: !136)
!161 = !DILocation(line: 55, scope: !136)
!162 = !DILocalVariable(name: "c", scope: !136, file: !1, line: 55, type: !89)
!163 = !DILocation(line: 56, scope: !136)
!164 = !DILocation(line: 57, scope: !136)
!165 = !DILocation(line: 60, scope: !136)
!166 = !DILocation(line: 62, scope: !136)
!167 = !DILocalVariable(name: "i", scope: !136, file: !1, line: 62, type: !86)
!168 = !DILocation(line: 63, scope: !136)
!169 = !DILocation(line: 65, scope: !136)
!170 = distinct !DISubprogram(name: "print_typetype", linkageName: "io.print_typetype", scope: !1, file: !1, line: 127, type: !171, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !96)
!171 = !DISubroutineType(types: !172)
!172 = !{null, !82, !173}
!173 = !DICompositeType(tag: DW_TAG_structure_type, name: "init.TypeInfo", scope: !1, file: !1, size: 384, elements: !174)
!174 = !{!175, !176}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !1, file: !1, baseType: !3, size: 64, align: 64)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "t", scope: !1, file: !1, baseType: !177, size: 320, align: 64, offset: 64)
!177 = !DICompositeType(tag: DW_TAG_structure_type, name: "init.TypeUnion", scope: !1, file: !1, size: 320, elements: !178)
!178 = !{!179, !186, !200, !209, !214, !219, !222, !231, !236}
!179 = !DIDerivedType(tag: DW_TAG_member, name: "basic", scope: !1, file: !1, baseType: !180, size: 256, align: 64)
!180 = !DICompositeType(tag: DW_TAG_structure_type, name: "init.BasicType", scope: !1, file: !1, size: 256, elements: !181)
!181 = !{!182, !183, !184, !185}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !1, file: !1, baseType: !15, size: 64, align: 64)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1, file: !1, baseType: !89, size: 32, align: 32, offset: 64)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1, file: !1, baseType: !89, size: 32, align: 32, offset: 96)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1, file: !1, baseType: !90, size: 128, align: 64, offset: 128)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "struct_", scope: !1, file: !1, baseType: !187, size: 320, align: 64)
!187 = !DICompositeType(tag: DW_TAG_structure_type, name: "init.StructType", scope: !1, file: !1, size: 320, elements: !188)
!188 = !{!189, !185, !199}
!189 = !DIDerivedType(tag: DW_TAG_member, name: "members", scope: !1, file: !1, baseType: !190, size: 128, align: 64)
!190 = !DICompositeType(tag: DW_TAG_structure_type, scope: !1, file: !1, size: 128, align: 64, elements: !191)
!191 = !{!85, !192}
!192 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1, file: !1, baseType: !193, size: 64, align: 64, offset: 64)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*init.StructMember", baseType: !194, size: 64, align: 64, dwarfAddressSpace: 0)
!194 = !DICompositeType(tag: DW_TAG_structure_type, name: "init.StructMember", scope: !1, file: !1, size: 192, elements: !195)
!195 = !{!196, !197}
!196 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1, file: !1, baseType: !90, size: 128, align: 64)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "t", scope: !1, file: !1, baseType: !198, size: 64, align: 64, offset: 128)
!198 = !DIBasicType(name: "type", size: 64, encoding: DW_ATE_unsigned)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1, file: !1, baseType: !89, size: 32, align: 32, offset: 256)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "function", scope: !1, file: !1, baseType: !201, size: 256, align: 64)
!201 = !DICompositeType(tag: DW_TAG_structure_type, name: "init.FunctionType", scope: !1, file: !1, size: 256, elements: !202)
!202 = !{!203, !208}
!203 = !DIDerivedType(tag: DW_TAG_member, name: "returns", scope: !1, file: !1, baseType: !204, size: 128, align: 64)
!204 = !DICompositeType(tag: DW_TAG_structure_type, scope: !1, file: !1, size: 128, align: 64, elements: !205)
!205 = !{!85, !206}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1, file: !1, baseType: !207, size: 64, align: 64, offset: 64)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*type", baseType: !198, size: 64, align: 64, dwarfAddressSpace: 0)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "args_t", scope: !1, file: !1, baseType: !204, size: 128, align: 64, offset: 128)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !1, file: !1, baseType: !210, size: 128, align: 64)
!210 = !DICompositeType(tag: DW_TAG_structure_type, name: "init.PointerType", scope: !1, file: !1, size: 128, elements: !211)
!211 = !{!212, !213}
!212 = !DIDerivedType(tag: DW_TAG_member, name: "pointee", scope: !1, file: !1, baseType: !198, size: 64, align: 64)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "is_optional", scope: !1, file: !1, baseType: !151, size: 8, align: 8, offset: 64)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "array", scope: !1, file: !1, baseType: !215, size: 128, align: 64)
!215 = !DICompositeType(tag: DW_TAG_structure_type, name: "init.ArrayType", scope: !1, file: !1, size: 128, elements: !216)
!216 = !{!217, !218}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "t", scope: !1, file: !1, baseType: !198, size: 64, align: 64)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "member_count", scope: !1, file: !1, baseType: !89, size: 32, align: 32, offset: 64)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "slice", scope: !1, file: !1, baseType: !220, size: 64, align: 64)
!220 = !DICompositeType(tag: DW_TAG_structure_type, name: "init.SliceType", scope: !1, file: !1, size: 64, elements: !221)
!221 = !{!217}
!222 = !DIDerivedType(tag: DW_TAG_member, name: "enum_", scope: !1, file: !1, baseType: !223, size: 320, align: 64)
!223 = !DICompositeType(tag: DW_TAG_structure_type, name: "init.EnumType", scope: !1, file: !1, size: 320, elements: !224)
!224 = !{!196, !225, !230}
!225 = !DIDerivedType(tag: DW_TAG_member, name: "member_names", scope: !1, file: !1, baseType: !226, size: 128, align: 64, offset: 128)
!226 = !DICompositeType(tag: DW_TAG_structure_type, scope: !1, file: !1, size: 128, align: 64, elements: !227)
!227 = !{!85, !228}
!228 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1, file: !1, baseType: !229, size: 64, align: 64, offset: 64)
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*string", baseType: !90, size: 64, align: 64, dwarfAddressSpace: 0)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "t", scope: !1, file: !1, baseType: !198, size: 64, align: 64, offset: 256)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !1, file: !1, baseType: !232, size: 128, align: 64)
!232 = !DICompositeType(tag: DW_TAG_structure_type, name: "init.VectorType", scope: !1, file: !1, size: 128, elements: !233)
!233 = !{!234, !235}
!234 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !1, file: !1, baseType: !50, size: 64, align: 64)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "elem_count", scope: !1, file: !1, baseType: !89, size: 32, align: 32, offset: 64)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "generic", scope: !1, file: !1, baseType: !237, size: 128, align: 64)
!237 = !DICompositeType(tag: DW_TAG_structure_type, name: "init.GenericType", scope: !1, file: !1, size: 128, elements: !238)
!238 = !{!196}
!239 = !DILocation(line: 127, scope: !170)
!240 = !DILocalVariable(name: "b", scope: !170, file: !1, line: 127, type: !82)
!241 = !DILocalVariable(name: "info", arg: 1, scope: !170, file: !1, line: 127, type: !173)
!242 = !DILocation(line: 128, scope: !170)
!243 = !DILocation(line: 130, scope: !170)
!244 = !DILocation(line: 133, scope: !170)
!245 = !DILocation(line: 136, scope: !170)
!246 = !DILocation(line: 137, scope: !170)
!247 = !DILocalVariable(name: "args", scope: !170, file: !1, line: 137, type: !204)
!248 = !DILocation(line: 138, scope: !170)
!249 = !DILocalVariable(name: "arg", scope: !170, file: !1, line: 138, type: !198)
!250 = !DILocalVariable(name: "i", scope: !170, file: !1, line: 138, type: !86)
!251 = !DILocation(line: 139, scope: !170)
!252 = !DILocation(line: 140, scope: !170)
!253 = !DILocation(line: 141, scope: !170)
!254 = !DILocation(line: 144, scope: !170)
!255 = !DILocation(line: 145, scope: !170)
!256 = !DILocation(line: 146, scope: !170)
!257 = !DILocation(line: 147, scope: !170)
!258 = !DILocalVariable(name: "t", scope: !170, file: !1, line: 147, type: !198)
!259 = !DILocalVariable(name: "i", scope: !170, file: !1, line: 147, type: !86)
!260 = !DILocation(line: 148, scope: !170)
!261 = !DILocation(line: 149, scope: !170)
!262 = !DILocation(line: 150, scope: !170)
!263 = !DILocation(line: 155, scope: !170)
!264 = !DILocation(line: 158, scope: !170)
!265 = !DILocation(line: 159, scope: !170)
!266 = !DILocation(line: 162, scope: !170)
!267 = !DILocation(line: 163, scope: !170)
!268 = !DILocation(line: 166, scope: !170)
!269 = !DILocation(line: 167, scope: !170)
!270 = !DILocation(line: 170, scope: !170)
!271 = !DILocation(line: 173, scope: !170)
!272 = !DILocation(line: 176, scope: !170)
!273 = !DILocation(line: 180, scope: !170)
!274 = distinct !DISubprogram(name: "print_type", linkageName: "io.print_type", scope: !1, file: !1, line: 182, type: !275, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !96)
!275 = !DISubroutineType(types: !276)
!276 = !{null, !82, !277}
!277 = !DICompositeType(tag: DW_TAG_structure_type, name: "init.Arg", scope: !1, file: !1, size: 128, elements: !278)
!278 = !{!217, !279}
!279 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1, file: !1, baseType: !280, size: 64, align: 64, offset: 64)
!280 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*void", baseType: null, size: 64, align: 64, dwarfAddressSpace: 0)
!281 = !DILocation(line: 182, scope: !274)
!282 = !DILocalVariable(name: "b", scope: !274, file: !1, line: 182, type: !82)
!283 = !DILocalVariable(name: "arg", arg: 1, scope: !274, file: !1, line: 182, type: !277)
!284 = !DILocation(line: 183, scope: !274)
!285 = !DILocalVariable(name: "t", scope: !274, file: !1, line: 183, type: !173)
!286 = !DILocation(line: 184, scope: !274)
!287 = !DILocation(line: 188, scope: !274)
!288 = !DILocalVariable(name: "basic", scope: !274, file: !1, line: 188, type: !180)
!289 = !DILocation(line: 189, scope: !274)
!290 = !DILocation(line: 190, scope: !274)
!291 = !DILocation(line: 191, scope: !274)
!292 = !DILocation(line: 193, scope: !274)
!293 = !DILocation(line: 196, scope: !274)
!294 = !DILocation(line: 197, scope: !274)
!295 = !DILocalVariable(name: "str", scope: !274, file: !1, line: 197, type: !90)
!296 = !DILocation(line: 198, scope: !274)
!297 = !DILocation(line: 207, scope: !274)
!298 = !DILocation(line: 208, scope: !274)
!299 = !DILocalVariable(name: "num", scope: !274, file: !1, line: 208, type: !108)
!300 = !DILocation(line: 209, scope: !274)
!301 = !DILocation(line: 211, scope: !274)
!302 = !DILocation(line: 212, scope: !274)
!303 = !DILocalVariable(name: "num", scope: !274, file: !1, line: 212, type: !108)
!304 = !DILocation(line: 213, scope: !274)
!305 = !DILocation(line: 215, scope: !274)
!306 = !DILocation(line: 216, scope: !274)
!307 = !DILocalVariable(name: "num", scope: !274, file: !1, line: 216, type: !108)
!308 = !DILocation(line: 217, scope: !274)
!309 = !DILocation(line: 219, scope: !274)
!310 = !DILocation(line: 220, scope: !274)
!311 = !DILocalVariable(name: "num", scope: !274, file: !1, line: 220, type: !108)
!312 = !DILocation(line: 221, scope: !274)
!313 = !DILocation(line: 223, scope: !274)
!314 = !DILocation(line: 224, scope: !274)
!315 = !DILocalVariable(name: "num", scope: !274, file: !1, line: 224, type: !86)
!316 = !DILocation(line: 225, scope: !274)
!317 = !DILocation(line: 227, scope: !274)
!318 = !DILocation(line: 228, scope: !274)
!319 = !DILocalVariable(name: "num", scope: !274, file: !1, line: 228, type: !86)
!320 = !DILocation(line: 229, scope: !274)
!321 = !DILocation(line: 231, scope: !274)
!322 = !DILocation(line: 232, scope: !274)
!323 = !DILocalVariable(name: "num", scope: !274, file: !1, line: 232, type: !86)
!324 = !DILocation(line: 233, scope: !274)
!325 = !DILocation(line: 235, scope: !274)
!326 = !DILocation(line: 236, scope: !274)
!327 = !DILocalVariable(name: "num", scope: !274, file: !1, line: 236, type: !86)
!328 = !DILocation(line: 237, scope: !274)
!329 = !DILocation(line: 239, scope: !274)
!330 = !DILocation(line: 240, scope: !274)
!331 = !DILocalVariable(name: "num", scope: !274, file: !1, line: 240, type: !86)
!332 = !DILocation(line: 241, scope: !274)
!333 = !DILocation(line: 243, scope: !274)
!334 = !DILocation(line: 244, scope: !274)
!335 = !DILocalVariable(name: "num", scope: !274, file: !1, line: 244, type: !108)
!336 = !DILocation(line: 245, scope: !274)
!337 = !DILocation(line: 247, scope: !274)
!338 = !DILocation(line: 248, scope: !274)
!339 = !DILocalVariable(name: "num", scope: !274, file: !1, line: 248, type: !340)
!340 = !DIBasicType(name: "f32", size: 32, encoding: DW_ATE_float)
!341 = !DILocation(line: 249, scope: !274)
!342 = !DILocation(line: 251, scope: !274)
!343 = !DILocation(line: 252, scope: !274)
!344 = !DILocalVariable(name: "num", scope: !274, file: !1, line: 252, type: !345)
!345 = !DIBasicType(name: "f64", size: 64, encoding: DW_ATE_float)
!346 = !DILocation(line: 253, scope: !274)
!347 = !DILocation(line: 255, scope: !274)
!348 = !DILocation(line: 256, scope: !274)
!349 = !DILocalVariable(name: "pt", scope: !274, file: !1, line: 256, type: !198)
!350 = !DILocation(line: 257, scope: !274)
!351 = !DILocalVariable(name: "info", scope: !274, file: !1, line: 257, type: !173)
!352 = !DILocation(line: 258, scope: !274)
!353 = !DILocation(line: 261, scope: !274)
!354 = !DILocation(line: 267, scope: !274)
!355 = !DILocalVariable(name: "st", scope: !274, file: !1, line: 267, type: !187)
!356 = !DILocation(line: 268, scope: !274)
!357 = !DILocation(line: 269, scope: !274)
!358 = !DILocation(line: 270, scope: !274)
!359 = !DILocalVariable(name: "n", scope: !274, file: !1, line: 270, type: !86)
!360 = !DILocation(line: 271, scope: !274)
!361 = !DILocalVariable(name: "m", scope: !274, file: !1, line: 271, type: !194)
!362 = !DILocation(line: 272, scope: !274)
!363 = !DILocation(line: 273, scope: !274)
!364 = !DILocation(line: 274, scope: !274)
!365 = !DILocation(line: 275, scope: !274)
!366 = !DILocalVariable(name: "ptr", scope: !274, file: !1, line: 275, type: !93)
!367 = !DILocation(line: 276, scope: !274)
!368 = !DILocalVariable(name: "offset", scope: !274, file: !1, line: 276, type: !86)
!369 = !DILocation(line: 277, scope: !274)
!370 = !DILocalVariable(name: "mem_arg", scope: !274, file: !1, line: 277, type: !277)
!371 = !DILocation(line: 281, scope: !274)
!372 = !DILocation(line: 283, scope: !274)
!373 = !DILocation(line: 284, scope: !274)
!374 = !DILocation(line: 285, scope: !274)
!375 = !DILocation(line: 288, scope: !274)
!376 = !DILocation(line: 303, scope: !274)
!377 = distinct !DISubprogram(name: "builder_to_string", linkageName: "io.builder_to_string", scope: !1, file: !1, line: 305, type: !378, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !96)
!378 = !DISubroutineType(types: !379)
!379 = !{!380, !82}
!380 = !DICompositeType(tag: DW_TAG_structure_type, scope: !1, file: !1, size: 128, align: 64, elements: !381)
!381 = !{!85, !382}
!382 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1, file: !1, baseType: !93, size: 64, align: 64, offset: 64)
!383 = !DILocation(line: 305, scope: !377)
!384 = !DILocalVariable(name: "b_in", scope: !377, file: !1, line: 305, type: !82)
!385 = !DILocation(line: 306, scope: !377)
!386 = !DILocalVariable(name: "b", scope: !377, file: !1, line: 306, type: !82)
!387 = !DILocation(line: 307, scope: !377)
!388 = !DILocalVariable(name: "alloc", scope: !377, file: !1, line: 307, type: !389)
!389 = !DICompositeType(tag: DW_TAG_structure_type, name: "mem.Allocator", scope: !1, file: !1, size: 192, elements: !390)
!390 = !{!391, !397, !401}
!391 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1, file: !1, baseType: !392, size: 64, align: 64)
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*fn(int, *mem.Allocator) -> ?*", baseType: !393, size: 64, align: 64, dwarfAddressSpace: 0)
!393 = !DISubroutineType(types: !394)
!394 = !{!280, !86, !395}
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mem.Allocator", baseType: !396, size: 64, align: 64, dwarfAddressSpace: 0)
!396 = !DICompositeType(tag: DW_TAG_structure_type, name: "mem.Allocator", scope: !1, file: !1, size: 192, align: 64, flags: DIFlagFwdDecl)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !1, file: !1, baseType: !398, size: 64, align: 64, offset: 64)
!398 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*fn(*, *mem.Allocator)", baseType: !399, size: 64, align: 64, dwarfAddressSpace: 0)
!399 = !DISubroutineType(types: !400)
!400 = !{null, !280, !395}
!401 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1, file: !1, baseType: !280, size: 64, align: 64, offset: 128)
!402 = !DILocation(line: 308, scope: !377)
!403 = !DILocalVariable(name: "res", scope: !377, file: !1, line: 308, type: !380)
!404 = !DILocation(line: 310, scope: !377)
!405 = !DILocalVariable(name: "i", scope: !377, file: !1, line: 310, type: !86)
!406 = !DILocation(line: 311, scope: !377)
!407 = !DILocalVariable(name: "ptr", scope: !377, file: !1, line: 311, type: !93)
!408 = !DILocation(line: 312, scope: !377)
!409 = !DILocation(line: 313, scope: !377)
!410 = !DILocation(line: 314, scope: !377)
!411 = !DILocation(line: 317, scope: !377)
!412 = !DILocalVariable(name: "size", scope: !377, file: !1, line: 317, type: !86)
!413 = !DILocation(line: 318, scope: !377)
!414 = !DILocalVariable(name: "j", scope: !377, file: !1, line: 318, type: !86)
!415 = !DILocation(line: 319, scope: !377)
!416 = !DILocation(line: 323, scope: !377)
!417 = distinct !DISubprogram(name: "print_type_with_formatter", linkageName: "io.print_type_with_formatter", scope: !1, file: !1, line: 326, type: !418, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !96)
!418 = !DISubroutineType(types: !419)
!419 = !{null, !82, !89, !277}
!420 = !DILocation(line: 326, scope: !417)
!421 = !DILocalVariable(name: "b", scope: !417, file: !1, line: 326, type: !82)
!422 = !DILocalVariable(name: "c", arg: 1, scope: !417, file: !1, line: 326, type: !89)
!423 = !DILocalVariable(name: "arg", arg: 2, scope: !417, file: !1, line: 326, type: !277)
!424 = !DILocation(line: 327, scope: !417)
!425 = !DILocalVariable(name: "t", scope: !417, file: !1, line: 327, type: !173)
!426 = !DILocation(line: 328, scope: !417)
!427 = !DILocation(line: 329, scope: !417)
!428 = !DILocalVariable(name: "str", scope: !417, file: !1, line: 329, type: !93)
!429 = !DILocation(line: 330, scope: !417)
!430 = !DILocalVariable(name: "i", scope: !417, file: !1, line: 330, type: !86)
!431 = !DILocation(line: 331, scope: !417)
!432 = !DILocation(line: 333, scope: !417)
!433 = !DILocation(line: 335, scope: !417)
!434 = !DILocalVariable(name: "c", scope: !417, file: !1, line: 335, type: !89)
!435 = !DILocation(line: 336, scope: !417)
!436 = !DILocation(line: 337, scope: !417)
!437 = !DILocation(line: 338, scope: !417)
!438 = !DILocation(line: 339, scope: !417)
!439 = !DILocation(line: 341, scope: !417)
!440 = !DILocation(line: 343, scope: !417)
!441 = !DILocation(line: 344, scope: !417)
!442 = !DILocation(line: 345, scope: !417)
!443 = !DILocation(line: 347, scope: !417)
!444 = distinct !DISubprogram(name: "__internal_print", linkageName: "io.__internal_print", scope: !1, file: !1, line: 350, type: !445, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !96)
!445 = !DISubroutineType(types: !446)
!446 = !{!83, !90, !447}
!447 = !DICompositeType(tag: DW_TAG_structure_type, scope: !1, file: !1, size: 128, align: 64, elements: !448)
!448 = !{!85, !449}
!449 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1, file: !1, baseType: !450, size: 64, align: 64, offset: 64)
!450 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*init.Arg", baseType: !277, size: 64, align: 64, dwarfAddressSpace: 0)
!451 = !DILocation(line: 350, scope: !444)
!452 = !DILocalVariable(name: "fmt", scope: !444, file: !1, line: 350, type: !90)
!453 = !DILocalVariable(name: "args", arg: 1, scope: !444, file: !1, line: 350, type: !447)
!454 = !DILocation(line: 351, scope: !444)
!455 = !DILocalVariable(name: "alloc", scope: !444, file: !1, line: 351, type: !389)
!456 = !DILocation(line: 352, scope: !444)
!457 = !DILocalVariable(name: "builder", scope: !444, file: !1, line: 352, type: !83)
!458 = !DILocation(line: 353, scope: !444)
!459 = !DILocalVariable(name: "arg_count", scope: !444, file: !1, line: 353, type: !86)
!460 = !DILocation(line: 354, scope: !444)
!461 = !DILocalVariable(name: "need_to_print_arg", scope: !444, file: !1, line: 354, type: !151)
!462 = !DILocation(line: 355, scope: !444)
!463 = !DILocalVariable(name: "c", scope: !444, file: !1, line: 355, type: !89)
!464 = !DILocalVariable(name: "i", scope: !444, file: !1, line: 355, type: !86)
!465 = !DILocation(line: 356, scope: !444)
!466 = !DILocation(line: 357, scope: !444)
!467 = !DILocation(line: 359, scope: !444)
!468 = !DILocation(line: 360, scope: !444)
!469 = !DILocalVariable(name: "arg", scope: !444, file: !1, line: 360, type: !277)
!470 = !DILocation(line: 361, scope: !444)
!471 = !DILocation(line: 362, scope: !444)
!472 = !DILocation(line: 363, scope: !444)
!473 = !DILocation(line: 365, scope: !444)
!474 = !DILocation(line: 370, scope: !444)
!475 = !DILocation(line: 371, scope: !444)
!476 = !DILocalVariable(name: "arg", scope: !444, file: !1, line: 371, type: !277)
!477 = !DILocation(line: 372, scope: !444)
!478 = !DILocation(line: 373, scope: !444)
!479 = !DILocation(line: 374, scope: !444)
!480 = !DILocation(line: 377, scope: !444)
!481 = distinct !DISubprogram(name: "vsprint", linkageName: "io.vsprint", scope: !1, file: !1, line: 381, type: !482, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !96)
!482 = !DISubroutineType(types: !483)
!483 = !{!90, !90, !447}
!484 = !DILocation(line: 381, scope: !481)
!485 = !DILocalVariable(name: "str", scope: !481, file: !1, line: 381, type: !90)
!486 = !DILocalVariable(name: "args", arg: 1, scope: !481, file: !1, line: 381, type: !447)
!487 = !DILocation(line: 382, scope: !481)
!488 = !DILocalVariable(name: "builder", scope: !481, file: !1, line: 382, type: !83)
!489 = !DILocation(line: 383, scope: !481)
!490 = !DILocalVariable(name: "res", scope: !481, file: !1, line: 383, type: !380)
!491 = !DILocation(line: 384, scope: !481)
!492 = !DILocation(line: 385, scope: !481)
!493 = distinct !DISubprogram(name: "sprint", linkageName: "io.sprint", scope: !1, file: !1, line: 388, type: !494, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !96)
!494 = !DISubroutineType(types: !495)
!495 = !{!90, !90}
!496 = !DILocation(line: 388, scope: !493)
!497 = !DILocalVariable(name: "str", scope: !493, file: !1, line: 388, type: !90)
!498 = !DILocalVariable(name: "args", arg: 1, scope: !493, file: !1, line: 388, type: !447)
!499 = !DILocation(line: 389, scope: !493)
!500 = !DILocalVariable(name: "builder", scope: !493, file: !1, line: 389, type: !83)
!501 = !DILocation(line: 390, scope: !493)
!502 = !DILocalVariable(name: "res", scope: !493, file: !1, line: 390, type: !380)
!503 = !DILocation(line: 391, scope: !493)
!504 = !DILocation(line: 392, scope: !493)
!505 = distinct !DISubprogram(name: "print", linkageName: "io.print", scope: !1, file: !1, line: 395, type: !506, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !96)
!506 = !DISubroutineType(types: !507)
!507 = !{null, !90}
!508 = !DILocation(line: 395, scope: !505)
!509 = !DILocalVariable(name: "str", scope: !505, file: !1, line: 395, type: !90)
!510 = !DILocalVariable(name: "args", arg: 1, scope: !505, file: !1, line: 395, type: !447)
